01_viv/01-viv-single-cylinder/cylinderAndBackground/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    topAndBottom
    {
        type            patch;
        nFaces          240;
        startFace       15645;
    }
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       15885;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       15945;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          15900;
        startFace       16005;
    }
    oversetPatch
    {
        type            overset;
        inGroups        1(overset);
        nFaces          75;
        startFace       31905;
    }
    cylinder
    {
        type            wall;
        inGroups        1(wall);
        nFaces          75;
        startFace       31980;
    }
)

// ************************************************************************* //
